In [1]:
# filter missing data from a Series
from numpy import nan as NA

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [5]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [6]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
# on a DataFrame, dropna by default drops any row that contains an NA value
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [8]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [10]:
# only drop rows that are ALL NA - use how='all'
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
# remember axis=1 means work on columns
data[4] = NA

In [12]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
# keep only rows that have a certain number of observations
df = pd.DataFrame(np.random.randn(7, 3))

In [15]:
df

          0         1         2
0 -0.326889 -0.032301  0.561671
1  0.436656 -0.391483  1.152824
2  0.571977 -1.372162  1.335683
3 -0.907488 -0.514764  0.225748
4  0.418339  1.455708  0.909148
5 -0.593539 -0.025702  0.069314
6 -1.470647  1.381178 -0.825801

In [16]:
# first 4 rows of column 1 are missing
df.iloc[:4, 1] = NA

In [17]:
# first 2 rows of column 2 are missing
df.iloc[:2, 2] = NA

In [18]:
df

          0         1         2
0 -0.326889       NaN       NaN
1  0.436656       NaN       NaN
2  0.571977       NaN  1.335683
3 -0.907488       NaN  0.225748
4  0.418339  1.455708  0.909148
5 -0.593539 -0.025702  0.069314
6 -1.470647  1.381178 -0.825801

In [19]:
# keep rows with 2 or more observations
df.dropna(thresh=2)

          0         1         2
2  0.571977       NaN  1.335683
3 -0.907488       NaN  0.225748
4  0.418339  1.455708  0.909148
5 -0.593539 -0.025702  0.069314
6 -1.470647  1.381178 -0.825801

In [20]:
# without thresh setting
df.dropna()

          0         1         2
4  0.418339  1.455708  0.909148
5 -0.593539 -0.025702  0.069314
6 -1.470647  1.381178 -0.825801

In [21]:
# use fillna to fill in missing data
# a constant uses that value to replace
df.fillna(0)

          0         1         2
0 -0.326889  0.000000  0.000000
1  0.436656  0.000000  0.000000
2  0.571977  0.000000  1.335683
3 -0.907488  0.000000  0.225748
4  0.418339  1.455708  0.909148
5 -0.593539 -0.025702  0.069314
6 -1.470647  1.381178 -0.825801

In [22]:
# pass in a dict to have a different value for each column
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.326889  0.500000  0.000000
1  0.436656  0.500000  0.000000
2  0.571977  0.500000  1.335683
3 -0.907488  0.500000  0.225748
4  0.418339  1.455708  0.909148
5 -0.593539 -0.025702  0.069314
6 -1.470647  1.381178 -0.825801

In [23]:
# fillna returns a new object
# you can modify in place
_ = df.fillna(0, inplace=True)

In [24]:
df

          0         1         2
0 -0.326889  0.000000  0.000000
1  0.436656  0.000000  0.000000
2  0.571977  0.000000  1.335683
3 -0.907488  0.000000  0.225748
4  0.418339  1.455708  0.909148
5 -0.593539 -0.025702  0.069314
6 -1.470647  1.381178 -0.825801

In [25]:
# you can use interpolation methods to fill. 'ffill' is forward fill
df = pd.DataFrame(np.random.randn(6, 3))

In [26]:
df.iloc[2:, 1] = NA

In [27]:
df.iloc[4:, 2] = NA

In [28]:
df

          0         1         2
0 -2.392492 -1.891097 -1.631601
1 -0.160564 -0.624398 -0.018474
2  1.054345       NaN -0.426534
3 -0.275821       NaN -1.223655
4 -0.052796       NaN       NaN
5 -0.125824       NaN       NaN

In [29]:
df.fillna(method='ffill')

          0         1         2
0 -2.392492 -1.891097 -1.631601
1 -0.160564 -0.624398 -0.018474
2  1.054345 -0.624398 -0.426534
3 -0.275821 -0.624398 -1.223655
4 -0.052796 -0.624398 -1.223655
5 -0.125824 -0.624398 -1.223655

In [30]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -2.392492 -1.891097 -1.631601
1 -0.160564 -0.624398 -0.018474
2  1.054345 -0.624398 -0.426534
3 -0.275821 -0.624398 -1.223655
4 -0.052796       NaN -1.223655
5 -0.125824       NaN -1.223655

In [31]:
# you can fill with the mean value for a series
data = pd.Series([1., NA, 3.5, NA, 7])

In [32]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64